Revit 2027 API
CoordinationModelLinkUtils Class
 The methods provided by this utility class support the managing of Coordination Model links in Revit documents and their visibility settings control in Revit views.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalData.CoordinationModelLinkUtils
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class CoordinationModelLinkUtils
Public NotInheritable Class CoordinationModelLinkUtils
public ref class CoordinationModelLinkUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type CoordinationModelLinkUtils = class end
The CoordinationModelLinkUtils type exposes the following members.
Methods
Name | Description
ContainsCategory |  Checks whether a provided string is a element category name in the provided AutodeskDocs Coordination Model type.
GetAllCoordinationModelInstanceIds |  Gets all Coordination Model instance ids in the document.
GetAllCoordinationModelTypeIds |  Gets all Coordination Model type ids in the document.
GetAllPropertiesForReferenceInsideCoordinationModel |  Gets all the properties for the provided Coordination Model instance reference.
GetCategoryForReferenceInsideCoordinationModel |  Returns the category name for the provided element reference inside the provided Coordination Model instance.
GetColorOverride |  Gets the color override value for the provided Coordination Model type.
GetColorOverrideForCategory |  Returns the color override value for the provided element category name inside the provided Coordination Model type.
GetCoordinationModelTypeData |  Gets link data for the provided Coordination Model type.
GetTransparencyOverride |  Gets the transparency override value for the provided Coordination Model type.
GetVisibilityOverride |  Gets the visibility override for the provided Coordination Model instance or type.
GetVisibilityOverrideForCategory |  Gets the visibility override for the provided element category name in the provided Coordination Model type.
GetVisibilityOverrideForReferenceInsideCoordinationModel |  Gets the visibility for the provided reference inside the Coordination Model from Autodesk Docs.
IsCoordinationModelInstance |  Checks whether an element is a Coordination Model instance.
IsCoordinationModelType |  Checks whether an element is a Coordination Model type.
Link3DViewFromAutodeskDocs |  Creates a Coordination Model instance based on the information provided by the specified Autodesk Docs data and linking options.
LinkCoordinationModelFromLocalPath |  Creates a Coordination Model instance using the absolute path of a .nwc or .nwd file and the linking options.
Reload |  Reloads the provided Coordination Model type element.
ReloadAutodeskDocsCoordinationModelFrom |  Reloads a Autodesk Docs Coordination Model type from the specified Autodesk Docs data.
ReloadLocalCoordinationModelFrom |  Reloads a local Coordination Model type from the specified absolute path of a .nwc or .nwd file.
SetColorOverride |  Sets the color override value for the provided Coordination Model type.
SetColorOverrideForCategory |  Set the color override value for the provided element category name inside the provided Coordination Model type.
SetTransparencyOverride |  Sets the transparency override value for the provided Coordination Model type.
SetVisibilityOverride |  Sets the visibility override for the provided Coordination Model instance or type. A value of true means that the graphics are visible.
SetVisibilityOverrideForCategory |  Sets the visibility override for the provided element category name inside the provided Coordination Model type.
SetVisibilityOverrideForReferenceInsideCoordinationModel |  Sets the visibility override for the provided reference inside the Coordination Model instance. A value of true means that the graphics are visible.
Unload |  Unloads the provided Coordination Model type element.
Top
Remarks
 Coordination Model links can be created from Autodesk Docs 3D views or local .nwc or .nwd files.
 A Coordination Model type holds the data that defines the link to a Autodesk Docs 3D view or a local .nwc or .nwd file. This data can be retrieved in the CoordinationModelLinkData object.
 A Coordination Model type can have multiple Coordination Model instances.
 Coordination Model type is an ElementType of BuiltInCategory.OST_Coordination_Model category. Coordination Model instance is an Element of BuiltInCategory.OST_Coordination_Model category.
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace